11_Lab_Session/solutions/Ritly_lesson11_solution/app/controllers/urls_controller.rb

INSERT INTO "urls" ("created_at", "hash_code", "link", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 16 Sep 2014 23:46:15 UTC +00:00], ["hash_code", 490957], ["link", "http://nblanchet.com/"], ["updated_at", Tue, 16 Sep 2014 23:46:15 UTC +00:00]]
---
  def create
    safe_url_params = params.require(:url).permit(:link)
    @url = Url.new safe_url_params
    @url.hash_code = rand(1..1000000)

    # For the bonus
    # @url.hash_code = SecureRandom.urlsafe_base64(8)

    @url.save

SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @url = Url.find params[:id]

SELECT "urls".* FROM "urls" WHERE "urls"."hash_code" = 'urls' LIMIT 1
---
  def redirector
    @url = Url.find_by hash_code: params[:code]