07_First_Rails_App/my_first_rails_app/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["author", "Twian"], ["created_at", Thu, 28 Aug 2014 23:42:24 UTC +00:00], ["title", "Huck Finn"], ["updated_at", Thu, 28 Aug 2014 23:42:24 UTC +00:00]]